<template>
  <!-- 
    @description: 
      所有 fill 属性要去掉
      需要保留viewBox属性(一键替换复制到剪贴板的js联系@jznzbw)

      vscode搜索"Svg Preview"插件,点击每一个可以看到预览图. 也可以单独开个路由去掉v-if可以查看全部图标

      希望大家共同维护本文件
   -->
  <!-- eslint-disable max-len 示范 -->
  <!-- 时钟 -->
  <svg v-if="name === 'clock'" viewBox="0 0 13 13" v-bind="attrs" aria-hidden="true">
    <path
      d="M6.5 12.75C3.04822 12.75 0.25 9.95175 0.25 6.5C0.25 3.04822 3.04822 0.25 6.5 0.25C9.95175 0.25 12.75 3.04822 12.75 6.5C12.75 9.95175 9.95175 12.75 6.5 12.75ZM6.5 11.5C9.26144 11.5 11.5 9.26144 11.5 6.5C11.5 3.73857 9.26144 1.5 6.5 1.5C3.73857 1.5 1.5 3.73857 1.5 6.5C1.5 9.26144 3.73857 11.5 6.5 11.5ZM7.125 6.5H9.625V7.75H5.875V3.375H7.125V6.5Z"
    />
  </svg>
  <!-- 聊天文件 -->
  <svg v-else-if="name === 'chatFile'" viewBox="0 0 30 30" v-bind="attrs" aria-hidden="true">
    <path
      d="M22.9549 19.4193L21.1871 17.6515L22.9549 15.8838C25.3956 13.443 25.3956 9.48572 22.9549 7.04495C20.5141 4.60416 16.5567 4.60416 14.116 7.04495L12.3482 8.81271L10.5805 7.04495L12.3482 5.27717C15.7654 1.86008 21.3055 1.86008 24.7226 5.27717C28.1397 8.69426 28.1397 14.2344 24.7226 17.6515L22.9549 19.4193ZM19.4192 22.9549L17.6515 24.7226C14.2345 28.1396 8.69426 28.1396 5.27717 24.7226C1.86008 21.3055 1.86008 15.7653 5.27717 12.3482L7.04493 10.5805L8.81271 12.3482L7.04493 14.116C4.60416 16.5568 4.60416 20.514 7.04493 22.9549C9.48571 25.3956 13.443 25.3956 15.8837 22.9549L17.6515 21.187L19.4192 22.9549ZM18.5354 9.6966L20.3032 11.4644L11.4644 20.3031L9.69658 18.5354L18.5354 9.6966Z"
    />
  </svg>
  <!-- 聊天发送 -->
  <svg v-else-if="name === 'chatSend'" viewBox="0 0 30 30" v-bind="attrs" aria-hidden="true">
    <path
      d="M27.1586 3.69621L20.3419 27.554C20.1533 28.2145 19.7476 28.2445 19.4456 27.6408L13.7502 16.25L2.40381 11.7115C1.76671 11.4567 1.7746 11.0753 2.44637 10.8514L26.3042 2.8988C26.9647 2.6786 27.3436 3.04836 27.1586 3.69621ZM23.7943 6.37062L8.51545 11.4636L15.5612 14.2819L19.3621 21.8835L23.7943 6.37062Z"
    />
  </svg>
</template>

<script setup>
defineProps({
  name: String,
})
const attrs = useAttrs()
</script>

<style scoped>
svg {
  /* 通过设置 font-size 来改变图标大小 */
  width: 1em;
  /* 图标和文字相邻时，垂直对齐 */
  vertical-align: -0.15em;
  /* 通过设置 color 来改变 SVG 的颜色/fill */
  fill: currentColor;
  /* path 和 stroke 溢出 viewBox 部分在 IE 下会显示
      normalize.css 中也包含这行 */
  overflow: hidden;
  /* display: block; */
  -webkit-transition:
    font-size 0.25s linear,
    width 0.25s linear;
  -moz-transition:
    font-size 0.25s linear,
    width 0.25s linear;
  transition:
    font-size 0.25s linear,
    width 0.25s linear;
}
</style>
